---
kind: property
id: P:Autodesk.Revit.DB.StringParameterValue.Value
source: html/a87d6b9a-dd5c-4929-25d3-bb6eb7f98917.htm
---
# Autodesk.Revit.DB.StringParameterValue.Value Property

The stored value

## Syntax (C#)
```csharp
public string Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null